In [48]:
import pandas as pd
import numpy as np

In [49]:
data = {
  'Name':['Shubham','Vaishnavi','Gudda','Gudiya'],
  'Age':[19,20,23,23],
  'Salary':[100000,70000,20,2100],
  'City':['Mau','Mau','Bengal', 'Asansol']
}

In [50]:
df = pd.DataFrame(data)
df

        Name  Age  Salary     City
0    Shubham   19  100000      Mau
1  Vaishnavi   20   70000      Mau
2      Gudda   23      20   Bengal
3     Gudiya   23    2100  Asansol

In [51]:
df['City']

0        Mau
1        Mau
2     Bengal
3    Asansol
Name: City, dtype: object

In [52]:
df[['City','Name']]  #column selection.

      City       Name
0      Mau    Shubham
1      Mau  Vaishnavi
2   Bengal      Gudda
3  Asansol     Gudiya

In [53]:
df['Designation'] = ['S.Engineer','S.Engineer','Doctor','Doctor']  #new column creation
df

        Name  Age  Salary     City Designation
0    Shubham   19  100000      Mau  S.Engineer
1  Vaishnavi   20   70000      Mau  S.Engineer
2      Gudda   23      20   Bengal      Doctor
3     Gudiya   23    2100  Asansol      Doctor

In [54]:
df.drop('Designation',axis=1)    #axis=0 -> row  #axis=1 -> column 
#it generates a copy do not modifies actual data.

        Name  Age  Salary     City
0    Shubham   19  100000      Mau
1  Vaishnavi   20   70000      Mau
2      Gudda   23      20   Bengal
3     Gudiya   23    2100  Asansol

In [55]:
df.drop('Designation',axis=1,inplace=True)
df

        Name  Age  Salary     City
0    Shubham   19  100000      Mau
1  Vaishnavi   20   70000      Mau
2      Gudda   23      20   Bengal
3     Gudiya   23    2100  Asansol

In [56]:
# df.drop('2',axis=0)

df.drop(2,axis=0)
df

        Name  Age  Salary     City
0    Shubham   19  100000      Mau
1  Vaishnavi   20   70000      Mau
2      Gudda   23      20   Bengal
3     Gudiya   23    2100  Asansol

In [57]:
df.loc[0]

Name      Shubham
Age            19
Salary     100000
City          Mau
Name: 0, dtype: object

In [58]:
df.iloc[0]

Name      Shubham
Age            19
Salary     100000
City          Mau
Name: 0, dtype: object

In [59]:
df.loc[[0,1]][['Age','Salary','Name']]

   Age  Salary       Name
0   19  100000    Shubham
1   20   70000  Vaishnavi

In [60]:
df.loc[[2,3]][['Name','Age']]

     Name  Age
2   Gudda   23
3  Gudiya   23

Conditional Selection

In [63]:
df[df['Age'] >=20]

        Name  Age  Salary     City
1  Vaishnavi   20   70000      Mau
2      Gudda   23      20   Bengal
3     Gudiya   23    2100  Asansol

In [ ]:
df[(df['Age'] > 19) & (df['City'] == 'Asansol')]  #conditional selection.

     Name  Age  Salary     City
3  Gudiya   23    2100  Asansol